tutorials/heatTransfer/buoyantBoussinesqSimpleFoam/iglooWithFridges/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-2.03 -2.0  0)
    ( 8.03 -2.0  0)
    ( 8.03  8.0  0)
    (-2.03  8.0  0)
    (-2.03 -2.0  5)
    ( 8.03 -2.0  5)
    ( 8.03  8.0  5)
    (-2.03  8.0  5)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (20 20 20) simpleGrading (1 1 1)
);

edges
(
);

patches
(

    wall ground
    (
        (0 3 2 1)
    )

);

mergePatchPairs
(
);

// ************************************************************************* //
